{"ISBN:0747581088": {"info_url": "http://openlibrary.org/books/OL24190024M/Harry_Potter_and_the_Half-blood_Prince", "bib_key": "ISBN:0747581088", "preview_url": "http://openlibrary.org/books/OL24190024M/Harry_Potter_and_the_Half-blood_Prince", "thumbnail_url": "http://covers.openlibrary.org/b/id/6368428-S.jpg", "details": {"key": "/books/OL24190024M", "publishers": ["Bloomsbury"], "subtitle": "Children's Edition", "description": {"type": "/type/text", "value": "Harry Potter and the Half-Blood Prince, the sixth book in J.K. Rowling’s bestselling series, picks up shortly after we left Harry at the end of The Order of the Phoenix. Lord Voldemort is acting out in the open, continuing his reign of terror which was temporarily stopped almost 15 years beforehand. Harry is again at the Dursleys, where the events of the previous month continue to weigh on his mind, although not as much as the impending visit from his Headmaster, Albus Dumbledore. Given their last meeting, Harry is understandably confused as to why the old wizard would want to visit him at home. \r\nRowling opens with a chapter she had wanted to use for the first book, of The Philosopher’s Stone--Lord Voldemort has been creating chaos in the Wizard and Muggle communities alike, the war is in full swing and the Wizarding community now lives in fear. The press have been questioning the events at the Ministry which led to the admission of Voldemort’s return, and of course Harry’s name is mentioned a number of times. Harry’s got his problems, but his anxiety is nothing compared to Hermione’s when the OWL results are delivered. There’s a new Defence Against The Dark Arts teacher, an assortment of new characters and creatures, and startling revelations about past characters and events. \r\n\r\nGone is the rage-filled Harry of The Order of the Phoenix--he’s not being kept in the dark any more, his unjustified Quidditch ban has been lifted and he has matured considerably in his short time out of school. Half-Blood Prince follows Harry into the world of late-teens, and his realisation that nobody is infallible has made his growth that much easier. Accepting his destiny, Harry continues to behave as teenagers do, enjoying his time with his friends, developing his relationships outside of his usual circle, and learning more about how he must, eventually, do what he is destined to do."}, "title": "Harry Potter and the Half-blood Prince", "series": ["Harry Potter 6"], "number_of_pages": 608, "isbn_13": ["9780747581086"], "covers": [6368428], "created": {"type": "/type/datetime", "value": "2010-04-16T11:27:50.433774"}, "languages": [{"key": "/languages/eng"}], "isbn_10": ["0747581088"], "latest_revision": 4, "edition_name": "1st", "last_modified": {"type": "/type/datetime", "value": "2011-11-04T18:06:37.297583"}, "authors": [{"name": "J. K. Rowling", "key": "/authors/OL23919A"}], "publish_date": "2005", "works": [{"key": "/works/OL16244512W"}], "type": {"key": "/type/edition"}, "revision": 4}, "preview": "noview"}}
